export default {
  /** UIのサイズ */
  ui: {
    /** 4 */
    l1: 4,
    /** 8 */
    l2: 8,
    /** 12 */
    l3: 12,
    /** 16 */
    l4: 16,
    /** 20 */
    l5: 20,
    /** 24 */
    l6: 24,
    /** 28 */
    l7: 28,
    /** 32 */
    l8: 32,
    /** 36 */
    l9: 36,
    /** 40 */
    l10: 40,
    /** 48 */
    l11: 48,
    /** 56 */
    l12: 56,
    /** 64 */
    l13: 64,
    /** 72 */
    l14: 72,
  },
  /** FONTのサイズ */
  font: {
    /** 10 */
    l0: 10,
    /** 12 */
    l1: 12,
    /** 14 */
    l2: 14,
    /** 16 */
    l3: 16,
    /** 20 */
    l4: 20,
    /** 24 */
    l5: 24,
  },
  /**
   * 画面幅のサイズ
   * 見た目的には余白も考慮する。余白*2の引き分が実際の幅。
   */
  responsive: {
    /** スマホ,一部タブレット（PCデザインで対応できる最小の幅） */
    sp: 820,
    /** PC最小 */
    pcMin: 820,
    /** PC最大 */
    pcMax: 1180,
  },
};
